#+BEGIN_COMMENT
---
layout: post
title:  "Emacs Org-Mode"
categories: linux
---
#+END_COMMENT
#+name: paper
#+begin_src lilypond :exports none
\version "2.16.0"
#(ly:set-option 'resolution 140)
\paper{
indent=0\mm
line-width=90\mm
oddFooterMarkup=##f
oddHeaderMarkup=##f
bookTitleMarkup=##f
scoreTitleMarkup=##f
}
#+end_src


Org-Mode stellt eine der interessantesten Entdeckungen dar, die ich die letzten Monate gemacht habe. Org-Mode ist ein Modus, also eine Erweiterung, für den Texteditor Emacs. Org-Mode dient, wie der Name bereits impliziert, der Organisation.

** Sourceblöcke
Man kann jedoch nicht nur LaTeX-Code exportieren oder verwenden, sondern auch nahezu jede Programmier- und Markupsprache. So gab es weiter oben bereits mehrfach Codebeispiele in Org-Mode. Diese gibt man einfach folgendermaßen an:

#+BEGIN_SRC org
,#+BEGIN_SRC org
,* Testüberschrift
,#+END_SRC
#+END_SRC

Hier nun ein Beispiel eines Programmcodes in Python, welcher beim Export direkt ausgeführt wird und das Ergebnis automatisch in eine Tabelle überführt wird. Es wurde keine Zahl händisch in die Tabelle eingetragen.

#+BEGIN_SRC python :exports both
# Fibonacci-Reihe
x = [[0] * 5 for i in range(5)]
x[0][0] = 1
for i in range(25):
    x[i % 5][i // 5] += x[(i - 1) % 5][(i - 1) // 5]
    x[i % 5][i // 5] += x[(i - 2) % 5][(i - 2) // 5]
return x

#+END_SRC

#+RESULTS:
| 1 |  8 |  89 |  987 | 10946 |
| 1 | 13 | 144 | 1597 | 17711 |
| 2 | 21 | 233 | 2584 | 28657 |
| 3 | 34 | 377 | 4181 | 46368 |
| 5 | 55 | 610 | 6765 | 75025 |

Ferner ist es möglich, die Ergebnisse eines Sourceblocks für den Input eines anderen Sourceblocks zu verwenden. Dementsprechend können, ähnlich zu Shellscripten, Pipes zwischen verschiedenen Programmiersprachen gebaut werden. Das Ergebnis kann an jeder beliebigen Stelle im Dokument durch einen Platzhalter eingefügt werden, wodurch es möglich ist, Tabellen und Grafiken automatisch immer auf den aktuellen Datenstand darzustellen.

Man kann sich auch vorstellen, dass backupscripte die Datei automatisch bei jedem Export sichert, oder aber für eine Website nachbereitet. Es ist vor allem Erfreulich, dass man sich dadurch das mühselige übertragen von Daten in Tabellen (beispielsweise in LaTeX) ersparen kann.

#+BEGIN_SRC python :exports both

# Zahlensystemkonverter
Konvertierungszahl = 1000
Zahlenraum = 20
Zahlensystem = [[0] for i in range(Zahlenraum - 1)]
Resultat = [[''] * 2 for i in range(Zahlenraum - 1)]

for i in range(2, Zahlenraum + 1):
    Stelle = 0
    Zahlensystem[i-2][0] = Konvertierungszahl
    while Zahlensystem[i-2][0] > 0:
          Stelle += 1
          Zahlensystem[i-2].insert(1,chr(ord('0')
                  + (Zahlensystem[i - 2][0] % i)))
          Zahlensystem[i-2][0] //= i
    Zahlensystem[i - 2][0] = i    

for i in range(Zahlenraum - 1):
    Resultat[i][0] = Zahlensystem[i][0]
    for j in range(1, len(Zahlensystem[i])):
        Resultat[i][1] += str(Zahlensystem[i][j])

return Resultat

#+END_SRC

#+RESULTS:
|  2 | 1111101000 |
|  3 |    1101001 |
|  4 |      33220 |
|  5 |      13000 |
|  6 |       4344 |
|  7 |       2626 |
|  8 |       1750 |
|  9 |       1331 |
| 10 |       1000 |
| 11 |        82: |
| 12 |        6;4 |
| 13 |        5;< |
| 14 |        516 |
| 15 |        46: |
| 16 |        3>8 |
| 17 |        37> |
| 18 |        31: |
| 19 |        2>< |
| 20 |        2:0 |

